Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Build for Armv7
zh_cn: 为 Armv7 构建

source: Build for Mac App Store
zh_cn: 为苹果应用商店（Mac App Store）构建

source: Build for Mips
zh_cn: 为 Mips 构建

source: Build for Mips64
zh_cn: 为 Mips64 构建

source: Build for x86
zh_cn: 为 x86 构建

source: Build for x86_64
zh_cn: 为 x86_64 构建

source: Building... {0}
zh_cn: 构建中... {0}

source: Built In Global Variables
zh_cn: 内置全局变量

source: Built-in Functions
zh_cn: 内置函数

source: Built-in Variable
zh_cn: 内置变量

source: Built-in Variables
zh_cn: 内置变量

source: Builtin Variables
zh_cn: 内置变量

source: Bundle ID
zh_cn: 捆绑包 ID

source: Bundle Id
zh_cn: 捆绑包 Id

source: Bundle Name
zh_cn: 捆绑包名称

source: Burst
zh_cn: 喷发

source: Burst Particles
zh_cn: 喷发粒子

source: Bursts particles on one step only from the given emitter.
zh_cn: 从指定的发射器中单步迸发粒子。

source: But computers can't do that - what they can do is this: (19 + 19) + 19.
zh_cn: 但计算机无法做到这一点 - 他们 能 做的是：（19 + 19）+ 19。

source: But first, let's take a practical example.
zh_cn: 但是首先，我们先看一下这个使用的例子

source: But what happens if here are other bits in there?
zh_cn: 但是，如果还有别的位在里面该怎么办呢？

source: But what if we want to initialize the array with different values for each position?
zh_cn: 但如果我们想给不同的位置赋予不同的值该怎么做？

source: But why the 31?
zh_cn: 但为什么会是 31？

source: But, the most important aspect of all, is patience.
zh_cn: 但是，最重要的方面，就是耐心。

source: But, when we talk about affecting or changing an object, we mean that we are modifying the object in the resource tree and anything we do to it will be reflected in all the instances created from that point on too.
zh_cn: 但是，当我们谈论影响或改变 物体 时，我们意味着我们正在修改资源树中的对象，并且我们所做的任何事情也将反映在从那一点创建的所有实例中。

source: Button
zh_cn: 按钮

source: Buttons
zh_cn: 按钮

source: By Default a new room will always contain a background layer, but you can remove it if you don't need it.
zh_cn: 默认情况下，新的房间将始终包含背景层，但是如果您不需要，可以将其删除。

source: By Default a new room will always contain an instance layer, but you can remove it if you don't need it.
zh_cn: 默认情况下，一个新的房间将会包含一个实例层，如果你不需要它，你可以删除它。

source: By assigning objects to a positive collision group (ie: three objects are all in group "2") you are telling GameMaker Studio 2 that instances of these objects should always collide, even if they have nothing in their collision event, obeying the physical properties that you have assigned them and the room they are in.
zh_cn: 通过将对象分配给一个正面的碰撞组（即：三个对象全部在组“ 2 ”中）你正在告诉 GameMaker Studio 2 这些对象的实例应该是总是碰撞，即使他们在碰撞事件中没有任何东西，服从你分配的物理属性和他们所在的空间。

source: By changing the 31 we can align to anything we like – as long as it's a power of 2.
zh_cn: 通过与 31 进行与非运算，我们可以对齐到任何我们喜欢的地方——只要它是 2 的倍数。

source: By checking this box, you are telling GameMaker Studio 2 to basically "ignore" the physical properties of the object, but still return a collision event with the objects around it.
zh_cn: 通过选中此框，您正在告诉GameMaker Studio 2基本上“忽略”对象的物理属性，但仍会返回与其周围的对象的碰撞事件。

source: By clicking on any of them, you will open up the Colour Picker where you can choose the colour and alpha that is to be blended with the general IDE colour for the node.
zh_cn: 通过点击任何一个选项，您都可以打开颜色选择器，您可以在其中选择要与常规 IDE 节点颜色混合的颜色和 alpha值。

source: By default GameMaker Studio 2 will run and debug using the built in VM (virtual machine), which is more or less the same as running on the desktop OS being used.
zh_cn: 默认情况下，GameMaker Studio 2 使用内置的 VM（虚拟机）运行和调试，这与您正在使用的桌面操作系统上运行的程序大致相同。

source: By default GameMaker Studio 2 comes with two skins, one light and one dark, and the initial setup uses the dark skin.
zh_cn: 默认地GameMaker Studio 2本身自带两种皮肤，一个是浅色皮肤，一个是深色皮肤，初始安装时会使用深色皮肤。

source: By default an object will use the collision properties of the sprite assigned to it, but there are cases whereby you may want collisions to be based off of a different mask shape.
zh_cn: 默认情况下，一个物体将使用分配给它的sprite的碰撞属性，但是有时您可能希望碰撞基于不同的掩码形状。

source: By default it shows both a Tree View (on the left) and a List View (on the right) but using this preference you can choose to have it only show one or the other.
zh_cn: 默认地，它会同时显示一个树状视图（左侧）和一个列表视图（右侧），但通过使用该设定，你可以选择只显示一个或另一个。

source: By default the application surface is enabled and all drawing for the Draw events will be done to that and the surface drawn to the screen.
zh_cn: 默认是启用应用表面层，所有绘制事件中的绘制将会在应用表面层中结束，然后将这个表面层绘制到屏幕上。

source: By default the corresponding resource editor will also be opened for editing when this happens, but un-checking this option will prevent the editors from being opened and you will be required to open them manually.
zh_cn: 默认地，当这种情况发生时，相应的资源编辑器会被打开，而解除该选项将会阻止编辑器被自动打开，并且你需要手动地打开他们。

source: By default the room tools will be placed on the left, with three main sections:
zh_cn: 默认情况下，房间工具将被放置在左侧，主要有三个部分：

source: By default this has one section dedicated to the Source Control plugin for integrating GameMaker Studio 2 projects with Git.
zh_cn: 默认有一个专门的子项源码控制插件整合GameMaker Studio 2项目与Git工具。

source: By default this is D:\Users\<Username>\AppData\Roaming\GameMakerStudio2-Dev\Cache.
zh_cn: 默认地，该路径为D:\Users\<Username>\AppData\Roaming\GameMakerStudio2-Dev\Cache。

source: By default this is \Users\<Username>\AppData\Local\Temp\GameMakerStudio2.
zh_cn: 默认为\Users\<Username>\AppData\Local\Temp\GameMakerStudio2。

source: By default this is \Users\<Username>\AppData\Roaming\GameMakerStudio2-Dev\Cache.
zh_cn: 默认为 \Users\<Username>\AppData\Roaming\GameMakerStudio2-Dev\Cache。

source: By default this is D:\Users\<Username>\Documents\GameMakerStudio2.
zh_cn: 默认地，该路径为D:\Users\<Username>\Documents\GameMakerStudio2。

source: By default this is \Users\<Username>\Documents\GameMakerStudio2.
zh_cn: 默认为 \Users\<Username>\Documents\GameMakerStudio2。

source: By default this is a grid of grey squares, but you can use the following settings to change it:
zh_cn: 默认地，网格为灰色正方形，但你可以用下列设定来改变它：

source: By default this is checked as on.
zh_cn: 该选项默认为开（On）

source: By default this is disabled and enabling it will remove the plain text list of action chains from the editor.
zh_cn: 默认该选项是禁用的，启用它将会移除编辑器左侧的纯文本动作链

source: By default this is disabled.
zh_cn: 默认禁用。

source: By default this is enabled, but in many cases you will want to take over when and how the surface is drawn (when using shaders for example), in which case you would use this function to set it to false so that you can draw it yourself when and how you require.
zh_cn: 默认是允许，但是也有许多需要接管何时及怎样进行表面绘制的情况 (比如使用着色器的时候)，这里你可以用这个函数设置为假，自主决定绘制的时间和方式。

source: By default this is off and resource tree text will only scale up not down.
zh_cn: 默认情况下此选项关闭，资源树文本只 能扩大 不能缩小。

source: By default this is on and resource tree text will scale up.
zh_cn: 默认情况下打开，资源树文本可以 扩大。

source: By default this is on, but can be set to OK to skip the message as if you'd clicked okay.
zh_cn: 该选项默认为开（On），但你可以将其设置为允许放行该消息，就好像你已经点过确认按钮那样。

source: By default this is set to "OK", but can be set to skip the message as if you'd clicked OK.
zh_cn: 默认为显示消息，但是可以设置为跳过。

source: By default this option is on.
zh_cn: 默认情况下，此选项打开。

source: By default you will be prompted to continue importing and overwrite the existing image or cancel the operation, and this option lets you suppress this message and either cancel the import, "No", or overwrite the current sprite, "Yes".
zh_cn: 默认情况下将提示你继续导入并覆盖现在图像或取消操作，这个选项允许你禁止这个信息显示，然后要么是取消导入（选择"否"NO），要么是覆盖当前精灵（选择“是” Yes）。

source: By default you will be prompted to continue or cancel the operation, and this option lets you suppress this message by selecting "Okay" which will go ahead with the tile set cell change regardless of the impact on room tilemap layers.
zh_cn: 默认情况下，将提示您继续或取消操作，此选项可以通过选择“是”来禁止消息并继续进行磁贴设置单元格更改，而不管对房间图块地图图层的影响。 默认值为“显示消息”。

source: By default, the GUI layer is 1:1 with the application surface resolution and drawn at the (0,0) position of the surface too.
zh_cn: 默认情况下，GUI层与应用表面层分辨率比例是1:1，绘制位置也是在表面层的(0,0)。

source: By default, the collision group for all physics objects is 0, and this means that they will interact as normal, which in turn means they must have a collision event to interact (a simple comment will do to trigger the collision) otherwise no collision will be registered.
zh_cn: 默认情况下，所有物理对象的碰撞组是 0 ，这意味着它们将正常相互作用，这又意味着它们必须有一个碰撞事件进行交互一个简单的评论将会触发碰撞）否则不会发生冲突。

source: By default, the visible flag is checked.
zh_cn: 该选项默认为开（On）.

source: By setting this option to "OK" the message will be suppressed as if you had clicked the "OK" button to proceed.
zh_cn: 通过将此选项设置为“是”，消息将被取消显示，并像您点击“确定”按钮一样继续。

source: By setting this option to "OK" the warning will be suppressed as if you had clicked the "OK" button to proceed.
zh_cn: 通过将此选项设置为“是”，警告将被取消显示，并像您点击“确定”按钮一样继续。

source: By setting this option to "OK" you can remove this message and permit frame deletion without further messages being shown.
zh_cn: 设置此项为“是”（OK），你就可以去掉这些消息并且在接下来没有任何消息显示的情况下就可以删除帧。

source: By setting this option to "OK" you can remove this message and permit frame edition to be committed without further messages being shown when you change tools.
zh_cn: 设置此项为“是”（OK），你就可以去掉这些消息并且在接下来当你改变工具的时候没有任何消息显示的情况下就提交修改。

source: By setting this option to "Okay" the message will be suppressed as if you had clicked the "Okay" button to proceed.
zh_cn: 通过设置这个选项为“确定（Okay）”，消息将会被阻止，就好像你已经点击了“确定”继续了。

source: By setting this option to "Okay" the warning will be suppressed as if you had clicked the "Okay" button to proceed.
zh_cn: 通过设置这个选项为“确定（Okay）”，警告消息将会被阻止，如果已经点击了“确定”。

source: By {0}
zh_cn: 作者：{0}

source: Bytes
zh_cn: 字节数

source: COMPLETED
zh_cn: 已完成

source: CPU Vendor:
zh_cn: CPU供应商：

source: CPU/GPU 'onion' memory pool size (MB)
zh_cn: CPU/GPU 'onion' 内存池大小 (MB)

source: CTRL + ALT + Down + Left
zh_cn: CTRL + ALT + Down + 左

source: CTRL + ALT + Down + Right
zh_cn: CTRL + ALT + Down + 右

source: CTRL + ALT + Up + Left
zh_cn: CTRL + ALT + Up + 左

source: CTRL + ALT + Up + Right
zh_cn: CTRL + ALT + Up + 右

source: CTRL + Enter / Numpad Enter
zh_cn: CTRL + Enter / 小键盘 Enter

source: CTRL + Minus (-)
zh_cn: CTRL + 减号(-)

source: CTRL + Minus(-) / Numpad Minus
zh_cn: CTRL + 减号(-) / 小键盘减号

source: CTRL + Plus (+)
zh_cn: CTRL + 加号(+)

source: CTRL + Plus(+) / Numpad Plus
zh_cn: CTRL + 加号(+) / 小键盘加号

source: CTRL + SHIFT + Down Arrow
zh_cn: CTRL + SHIFT + 方向键下

source: CTRL + SHIFT + Left Arrow
zh_cn: CTRL + SHIFT + 方向键左

source: CTRL + SHIFT + Numpad+
zh_cn: CTRL + SHIFT + 小键盘加号

source: CTRL + SHIFT + Numpad-
zh_cn: CTRL + SHIFT + 小键盘减号

source: CTRL + SHIFT + NumpadEnter
zh_cn: CTRL + SHIFT + 小键盘Enter

source: CTRL + SHIFT + Right Arrow
zh_cn: CTRL + SHIFT + 方向键右

source: CTRL + [Numpad0 ...
zh_cn: CTRL + [小键盘0 ...

source: CTRL+ SHIFT + [Numpad0 ...
zh_cn: CTRL+ SHIFT + [小键盘0 ...

source: Cache Path
zh_cn: 缓存路径

source: Call Count
zh_cn: 调用次数

source: Call D&D Script
zh_cn: 调用D&D脚本

source: Call D&D Script With Return Value
zh_cn: 调用带有返回值的D&D脚本

source: Call Parent Event
zh_cn: 调用父事件

source: Call Stack
zh_cn: 调用堆栈

source: Call User Event
zh_cn: 调用用户事件

source: Call a user event on an instance.
zh_cn: 调用实例的用户事件

source: Call any function with optional arguments and get the return value of the function.
zh_cn: 使用可选的参数调用任意函数，并且获取函数的返回值。

source: Call this event on the instance's parent object.
zh_cn: 调用实例的父物体上的这个事件。

source: Camera
zh_cn: 摄像机

source: Camera Properties
zh_cn: 相机属性

source: Cameras
zh_cn: 相机

source: Can Be Relative?
zh_cn: 可以是相对的吗？

source: Can Be Temp?
zh_cn: 可以是临时的吗？

source: Can not add more vertices to a finished PrimitiveBuilder.
zh_cn: 不能在已经完成的图元构建器（PrimitiveBuilder）里添加更多的顶点。

source: Can not set requested style, not found
zh_cn: 无法设置请求的样式，未找到。

source: Can't Delete Last Layer
zh_cn: 无法删除最后一个图层

source: Can't delete layer - image must have at least one layer
zh_cn: 无法删除图层 - 显示图像至少需要一个图层

source: Cancel
zh_cn: 取消

source: Cancel Selection
zh_cn: 取消选择

source: Cancel current selection / break in progress arc or polygon
zh_cn: 取消当前选择/中断绘制弧线或多边形的进程

source: Cancel the current selection
zh_cn: 取消当前选择

source: Cancelling debugger connection.
zh_cn: 取消调试器连接。

source: Cannot access Marketplace.
zh_cn: 无法访问市场。

source: Cannot access Marketplace: User is offline
zh_cn: 无法访问市场：用户处于离线状态

source: Cannot access account management: User is offline
zh_cn: 无法访问帐号管理：用户离线

source: Cannot access file: {0}
zh_cn: 无法访问文件 {0}

source: Cannot add existing {0} resources
zh_cn: 不能添加现有的 {0} 资源

source: Cannot calculate actual position of gadget
zh_cn: 无法计算小工具的真实坐标

source: Cannot calculate actual position of gadget, too few anchors and/or dimensions are set
zh_cn: 不能计算出部件的实际位置，锚点太少或者大小已经设置。

source: Cannot change event
zh_cn: 无法变更事件

source: Cannot complete operation.
zh_cn: 无法完成操作。

source: Cannot create configurations with GameMaker Studio 2 Trial
zh_cn: 无法使用GameMaker Studio 2试用版创建配置

source: Cannot create configurations with the Trial version of GameMaker Studio 2
zh_cn: 无法使用GameMaker Studio 2试用版创建配置

source: Cannot delete configuration '{0}'
zh_cn: 无法删除配置 '{0}'

source: Cannot duplicate existing configuration name
zh_cn: 不能与现有的配置名称重复

source: Cannot find Private key - please ensure path is valid
zh_cn: 不能找到私钥 - 请确保路径有效

source: Cannot find Public key - please ensure path is valid
zh_cn: 无法找到公共密钥 - 请确认路径是否有效

source: Cannot find yydebug file specified.
zh_cn: 无法找到指定的 yydebug 文件。

source: Cannot import dependant resources.
zh_cn: 无法导入依赖的资源。

source: Cannot import incompatible resource: {0} (unknown file type)
zh_cn: 无法导入不兼容的资源： {0} （未知文件类型）

source: Cannot paint on layer groups
zh_cn: 无法在图层组上绘画

source: Cannot paint on layer groups; select a non-group layer
zh_cn: 不能在图层组上绘画; 选择一个非组图层?

source: Cannot paint to a locked or invisible layer
zh_cn: 不能绘制在被锁定的或者不可见的图层上

source: Cannot paint to the selected layer - it is locked or hidden
zh_cn: 无法绘制到所选图层 - 它被锁定或隐藏

source: Cannot parse the expiry date
zh_cn: 无法解析截止日期

source: Cannot regenerate this action.
zh_cn: 该动作不能重新生成。

source: Cannot rename '{0}' configuration
zh_cn: 无法重命名 '{0}' 配置

source: Cannot rename Default View
zh_cn: 无法重命名默认视图。

source: Cannot run AVD directly with version '{0}' of the Android SDK.\nPlease launch 'Android Studio' and select 'Tools > Android > AVD Manager'.
zh_cn: 无法直接使用Android SDK的版本“{0}”运行AVD。\n请启动“Android Studio”并选择“Tools> Android> AVD Manager”。

source: Cannot save changes to {0} because it has an empty URL
zh_cn: 无法保存更改至 {0} 因为它的网址（URL）为空

source: Canvas
zh_cn: 画布

source: Canvas block size (block pattern style)
zh_cn: 透明背景块大小 (块图案样式)

source: Canvas primary colour
zh_cn: 透明背景颜色 1

source: Canvas secondary colour (block pattern style)
zh_cn: 透明背景颜色 2 (块图案样式)

source: Canvas style
zh_cn: 透明背景样式（Canvas）

source: Capitalization
zh_cn: 大写

source: Caption
zh_cn: 标题

source: Card Games.
zh_cn: 纸牌游戏

source: Case
zh_cn: 情形（Case）

source: Case Sensitive
zh_cn: 区分大小写

source: Categories
zh_cn: 目录

source: Caught exception for gadget of type '{1}' and style '{2}'- {0}
zh_cn: 针对“{1}”类型和样式“{2}”的部件的捕获异常情况 - {0}

source: Ceil
zh_cn: 向上取整(Ceil)

source: Center
zh_cn: 中心

source: Center image and scale to fill current view
zh_cn: 居中图像并缩放到填充视野为止

source: Center image with unit scale
zh_cn: 以单位尺度居中图像

source: Centers the region based on the viewable or browser area.
zh_cn: 在可视范围或浏览器上将一个区域居中放置。

source: Centre Fit
zh_cn: 居中适配

source: Centre game in Browser window
zh_cn: 浏览器窗口游戏居中

source: Centre game in browser window
zh_cn: 浏览器窗口居中

source: Certain platforms (like iOS or Android) permit you to associate one or more devices with GameMaker Studio 2 so that games can selectively compile to them.
zh_cn: 某些平台（如 iOS 或 Android）允许您将一个或多个设备与 GameMaker Studio 2 相关联，以便游戏可以有选择地进行编译。

source: Certificate (JS)
zh_cn: 证书 (JS)

source: Certificate (Native)
zh_cn: 证书 (本地)

source: Certificate Check
zh_cn: 检测证书

source: Certificate File:
zh_cn: 证书文件：

source: Certificate Location
zh_cn: 证书位置

source: Certificate Password:
zh_cn: 证书密码：

source: Certificate file '{0}' already exists; please choose a new filename
zh_cn: 证书文件 '{0}' 已经存在；请选项一个新的文件名

source: Certificate file '{0}' could not be found - please check Marketplace certificate settings
zh_cn: 没有找到证书文件 '{0}' - 请检查市场证书设置

source: Certificate file '{0}' could not be found -\nPlease check Marketplace certificate settings
zh_cn: 找不到证书文件'{0}' -\n请检查市场证书设置

source: Certificate file has not been set - please check Marketplace certificate settings
zh_cn: 证书文件尚未设置 - 请检查市场证书设置

source: Certificate file has not been set -\nPlease check Marketplace certificate settings
zh_cn: 证书文件尚未被设定 -\n请检查市场证书设定

source: Chain fade out start distance (px)
zh_cn: 链条淡出开始距离(px)

source: Chain fade out stop distance (px)
zh_cn: 链条淡出停止距离 (px)

source: Chain link colour
zh_cn: 链条连接（Chain link）颜色

source: Chain minimum alpha
zh_cn: 链条最小alpha值

source: Change
zh_cn: 变更

source: Change Description
zh_cn: 更改描述

source: Change Event
zh_cn: 变更事件

source: Change Instance
zh_cn: 变更实例

source: Change Moment
zh_cn: 更改时刻

source: Change an instance to be an instance of another object.
zh_cn: 将一个实例变变为另一个物体的实例。

source: Change the selected moment
zh_cn: 改变所选时刻

source: Change the selected moment description
zh_cn: 改变所选时刻的描述

source: Change the sprite of an object instance.
zh_cn: 更改物体实例的精灵。

source: Changed line
zh_cn: 更改行

source: Changed line colour
zh_cn: 更改行颜色

source: Changes detected in base project directory '{0}'.
zh_cn: 基础项目目录(?)'{0}'中监测到更改。

source: Changes detected in project directory '{0}'.
zh_cn: 项目目录'{0}'中监测到更改。

source: Changing
zh_cn: 改变

source: Changing DnD™ To Code
zh_cn: 拖拽按钮转换为代码

source: Changing this option to "Okay" will suppress the message and go ahead with the action as if you'd clicked "Okay" in the dialog.
zh_cn: 将此选项更改为“是”将会取消显示该消息，并继续执行该操作，就像您在对话框中单击“是”一样。

source: Changing this option to "Okay" will suppress the message and go ahead with the conversion as if you'd clicked "Okay" in the dialog.
zh_cn: 将此选项更改为“是”会取消显示该消息，并继续进行转换，就像在对话框中单击“是”一样。

source: Characters
zh_cn: 字符

source: Check
zh_cn: 检测

source: Check Android NDK
zh_cn: 检测Android NDK

source: Check Android SDK
zh_cn: 检测Android SDK

source: Check For Updates
zh_cn: 检查更新

source: Check IDE still running (i.e. cancelled from Uninstall)
zh_cn: 检查IDE是否仍在运行（可以取消卸载）

source: Check for publishing errors
zh_cn: 检测发布错误

source: Check for weak reference
zh_cn: 弱引用检查

source: Check if a data structure exists.
zh_cn: 检测是否存在一个数据结构。

source: Check if a data structure is empty.
zh_cn: 检测一个数据结构是否为空。

source: Check if a gamepad button is down or released.
zh_cn: 检测某个游戏手柄按钮是否压住或松开。

source: Check if a gamepad button is pressed.
zh_cn: 检测某个游戏手柄的按钮是否按下。

source: Check if a gamepad button is released.
zh_cn: 检测手柄按钮是否松开。

source: Check if a key is down or released.
zh_cn: 检测一个键位是压住还是释放。

source: Check if a key is pressed.
zh_cn: 检测一个键位是否被按下。

source: Check if a key is released.
zh_cn: 检测一个键位是否被松开。

source: Check if a mouse button is held or released.
zh_cn: 检测一个鼠标键是否被压住或释放。

source: Check if a mouse button is pressed.
zh_cn: 检测一个鼠标键是否按下。

source: Check if a mouse button is released.
zh_cn: 检测一个鼠标键是否被松开。

source: Check if a sound effect or a music track is paused.
zh_cn: 检查是否一个音效或者音乐音轨已经暂停。

source: Check if a sound effect or a music track is playing.
zh_cn: 检查音效或者音乐音轨是否正在播放

source: Check if a variable is or isn't undefined.
zh_cn: 检查一个变量是否未定义。

source: Check if a variable satisfies a condition.
zh_cn: 检查一个变量是否满足条件。

source: Check if an expression is true or false.
zh_cn: 检查一个表达式的真假

source: Check if an instance intersects another instance at a position.
zh_cn: 检查一个实例是否在指定的位置与另外一个实例交叠。

source: Check if an instance intersects any other instances at a position.
zh_cn: 检查一个实例是否在指定的位置相交了任何其它的实例。

source: Check if an instance is intersecting a shape.
zh_cn: 检查一个实例是否与一个形状发生碰撞。

source: Check if an instance overlaps any object instances at a position.
zh_cn: 检查实例是否与某个位置的任何物体实例重叠。

source: Check if an instance overlaps one or more instances of a specific object at a position.
zh_cn: 检查实例是否与某个位置的特定物体的一个或多个实例重叠。

source: Check if an instance's health satisfies a condition.
zh_cn: 检查一个实例的健康值是否满足一个条件。

source: Check if an instance's lives satisfies a condition.
zh_cn: 检查一个实例的生命数是否满足一个条件。

source: Check if an instance's score satisfies a condition.
zh_cn: 检查一个实例的分数是否满足一个条件。

source: Check if one or more instances intersect a point.
zh_cn: 检测一个或多个实例是否与一点相交。

source: Check if one or more instances intersect a shape.
zh_cn: 检测一个或多个实例是否与一个形状相交。

source: Check if the current room is the first room or not.
zh_cn: 检查当前房间是否为第一个房间。

source: Check if the current room is the last room or not.
zh_cn: 检查当前房间是否为最后一个。

source: Check if the virtual keyboard is showing.
zh_cn: 检测虚拟键盘是否正在显示。

source: Check that the password is valid for the selected certficate file
zh_cn: 检测密码对于证书是否有效

source: Check to uncompress zip
zh_cn: 检查以解压zip

source: Check your Preferences.
zh_cn: 检查你的偏好设置。

source: Check your target settings.
zh_cn: 检查你的目标平台设置。

source: Checkbox
zh_cn: 复选框

source: Checking Data Types
zh_cn: 数据类型检测

source: Checking Device...
zh_cn: 正在检查设备...

source: Checking Out...
zh_cn: 正在签出...

source: Checking Performance
zh_cn: 检测性能

source: Checking RSS...
zh_cn: 检查RSS...

source: Checking this will also open a further chained window where you can define the physical properties of all instances of this object.
zh_cn: 检查此操作还将打开一个进一步链接的窗口，您可以在其中定义该对象的所有实例的物理属性。

source: Checks if a buffer exists.
zh_cn: 检查一个缓冲区是否存在。

source: Checks if a file exists.
zh_cn: 检测文件是否存在。

source: Checks if an instance exists.
zh_cn: 检测是否存在一个实例。

source: Checks if the end of a buffer has been reached.
zh_cn: 检查是否已到达缓冲区的末尾。

source: Child Gadgets
zh_cn: 子级部件

source: Child Windows
zh_cn: 子窗口

source: Children
zh_cn: 子级

source: Choices are rectangle, rotated rectangle, ellipse, diamond, or precise (per frame).
zh_cn: 可选矩形、旋转矩形、椭圆、菱形或精确（每帧）。

source: Choose Merge Tool
zh_cn: 选择合并工具

source: Choose a resize option
zh_cn: 选择调整大小选项

source: Choose an Asset
zh_cn: 选择一个资产

source: Choose sound file
zh_cn: 选择声音文件

source: Circle
zh_cn: 圆形

source: Class Name:
zh_cn: 类名：

source: Clean
zh_cn: 清理

source: Clean (${clean_program})
zh_cn: 清理 (${clean_program})

source: Clean (CTRL + F7)
zh_cn: 清理 (CTRL + F7)

source: Clean Runtimes Now
zh_cn: 立即清理运行库

source: Clean Up
zh_cn: 清理

source: Clean the compiler cache
zh_cn: 清理编译器缓存

source: Clear
zh_cn: 清除

source: Clear All
zh_cn: 清空全部

source: Clear All Items
zh_cn: 清除所有项目

source: Clear Data Structure
zh_cn: 清空数据结构

source: Clear Devices
zh_cn: 清除设备

source: Clear Display Buffer
zh_cn: 清除显示缓冲区

source: Clear Favourites
zh_cn: 清除最喜爱

source: Clear Grid
zh_cn: 清空栅格

source: Clear List
zh_cn: 清空列表

source: Clear Output Window on Compile
zh_cn: 编译时清空输出窗口

source: Clear Particle System
zh_cn: 清空粒子系统

source: Clear Recently Used
zh_cn: 清除最近使用

source: Clear SSH Key
zh_cn: 清除 SSH 密钥

source: Clear Selection
zh_cn: 清空所选

source: Clear Viewport Background
zh_cn: 清除视口背景

source: Clear a grid to a specific value.
zh_cn: 使用指定值清空整个栅格。

source: Clear font cache
zh_cn: 清除字体缓存

source: Clear output window on compile start
zh_cn: 编译开始时清除输出窗口

source: Clear the contents of a data structure.
zh_cn: 清空一个数据结构的内容。

source: Clear the particle system.
zh_cn: 清空该粒子系统。

source: Clearing these bits (as we saw above) is simply a matter of using the NOT modifier, like this:
zh_cn: 而清空这些位（如上文所见）只是使用位非修饰符（~）的问题，像这样：

source: Clears the settings of a given emitter.
zh_cn: 清空指定发射器的设定。

source: Click and drag to draw a line (Shift for a straight line)
zh_cn: 单击并拖动以绘制线条（Shift为直线）

source: Click and drag to draw a rectangle (Shift for a square)
zh_cn: 点击拖拽并绘制一个矩形 (按住Shift为正方形)

source: Click and drag to draw an ellipse (Shift for a circle)
zh_cn: 点击并拖拽绘制一个椭圆 (按住Shift为正圆)

source: Click and drag to pan
zh_cn: 点击拖动以平移

source: Click and drag to replace selection (${ctrl} to add to selection, Alt to subtract from selection)
zh_cn: 点击并拖拽替换选区 (${ctrl} 添加到选区， Alt 减去选区)

source: Click and drag to replace selection (Ctrl to add to selection, Alt to subtract from selection)
zh_cn: 点击并拖拽替换选区(Ctrl添加到选区， Alt减去选区)

source: Click and drag to replace selection (Ctrl to add to selection, Shift to subtract from selection)
zh_cn: 点击拖拽以替换选区(Ctrl添加到选区， Shift从选区减去)

source: Click and drag to rotate current brush
zh_cn: 点击拖拽以旋转当前画笔
